uhnp/src/Catalogs/СерверыОчередейRMQ/СерверыОчередейRMQ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СерверыОчередейRMQ</name>
  <comment>Выполнение задач № 000035594</comment>
  <predefined>
    <items>
      <name>Основной</name>
    </items>
  </predefined>
  <attributes>
    <name>АдресСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВиртуальныйХост</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЗащищенноеСоединение</name>
    <comment>// Калинин А. 02.10.2019 Выполнение задач №000033040</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>PEMФайлСертификатаУдостоверяющегоЦентра</name>
    <comment>// Калинин А. 02.10.2019 Выполнение задач №000033040</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PEMФайлЗакрытогоКлючаКлиента</name>
    <comment>// Калинин А. 02.10.2019 Выполнение задач №000033040</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PEMФайлСертификатаКлиента</name>
    <comment>// Калинин А. 02.10.2019 Выполнение задач №000033040</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/CommonModules/ОчередьСообщений/Module.bsl
//////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


// Выполняет низкоуровневое соединение с сервером RMQ
//
Процедура УстановитьСоединение(Знач Клиент, Знач КлючСоединения = "") Экспорт

	Перем Адрес;
	Перем Порт;
	Перем Логин;
	Перем Пароль;
	Перем ВиртуальныйХост;
	
	Если Не ЗначениеЗаполнено(КлючСоединения) Тогда
		КлючСоединения = Справочники.СерверыОчередейRMQ.КлючСоединенияОсновной();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыСервера = ПолучитьНастройкиСервера(КлючСоединения);
	
	ОбработатьУмолчание(ПараметрыСервера.Порт,            5672);
	ОбработатьУмолчание(ПараметрыСервера.Логин,           "guest");
	ОбработатьУмолчание(ПараметрыСервера.Пароль,          "guest");
	ОбработатьУмолчание(ПараметрыСервера.ВиртуальныйХост, "/");
	
	// НАЧАЛО Калинин А. 02.10.2019 Выполнение задач №000033040
	Если ПараметрыСервера.ИспользоватьЗащищенноеСоединение Тогда
		Клиент.УстановитьЗащищенноеСоединение(
		    ПараметрыСервера.PEMФайлСертификатаУдостоверяющегоЦентра,
			ПараметрыСервера.PEMФайлЗакрытогоКлючаКлиента,
			ПараметрыСервера.PEMФайлСертификатаКлиента,
			ПараметрыСервера.АдресСервера,
			ПараметрыСервера.Логин,
			ПараметрыСервера.Пароль,
			ПараметрыСервера.Порт,
			ПараметрыСервера.ВиртуальныйХост);		
	Иначе
	// КОНЕЦ Калинин А. 02.10.2019 Выполнение задач №000033040
		Клиент.УстановитьСоединение(
			ПараметрыСервера.АдресСервера,
			ПараметрыСервера.Логин,
			ПараметрыСервера.Пароль,
			ПараметрыСервера.Порт,
			ПараметрыСервера.ВиртуальныйХост);
	// НАЧАЛО Калинин А. 02.10.2019 Выполнение задач №000033040
	КонецЕсли;
	// КОНЕЦ Калинин А. 02.10.2019 Выполнение задач №000033040
	
КонецПроцедуры // УстановитьСоединение()

Процедура ОбработатьУмолчание(Значение, Знач Умолчание)

	Если Значение = Неопределено Тогда
		Значение = Умолчание;
	КонецЕсли;

КонецПроцедуры

// Инициализирует объект внешней компоненты
//
Функция СоздатьЭкземплярКомпоненты() Экспорт

	КлиентСервераОчередей = Обработки.КлиентОчередиСообщений.Создать();
	Возврат КлиентСервераОчередей;

КонецФункции // СоздатьЭкземплярКомпоненты()

// Создает экземпляр компоненты и устанавливает соединение с сервером.
//
Функция ПолучитьЭкземплярКомпоненты(Знач КлючСоединения = "") Экспорт

	Если Не ЗначениеЗаполнено(КлючСоединения) Тогда
		КлючСоединения = Справочники.СерверыОчередейRMQ.КлючСоединенияОсновной();
	КонецЕсли;
	
	Компонента = СоздатьЭкземплярКомпоненты();
	УстановитьСоединение(Компонента, КлючСоединения);
	
	Возврат Компонента;

КонецФункции // ПолучитьЭкземплярКомпоненты()

// Функция - Возможные свойства сообщения
// 
// Возвращаемое значение:
//   - 
//
Функция ВозможныеСвойстваСообщения(Знач АнглийскиеИмена = Ложь) Экспорт
	
	Возврат ОчередьСообщенийПовтИсп.ВозможныеСвойстваСообщения(АнглийскиеИмена);

КонецФункции

///////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Получает настраиваемые параметры сервера очередей
//
// Параметры:
//  КлючСоединения - Строка - Псевдоним сервера
// 
// Возвращаемое значение:
//   - Структура. Поля структуры совпадают с реквизитами справочника СерверыОчередейRMQ
//   	ключи: АдресСервера, ВиртуальныйХост, Порт, Логин, Пароль 
//
Функция ПолучитьНастройкиСервера(Знач КлючСоединения) Экспорт
	
	Возврат Справочники.СерверыОчередейRMQ.ПолучитьПараметрыСервера(КлючСоединения);
	
КонецФункции

// Заполнить список возможных ключей соединения
//
Процедура ЗаполнитьСписокВозможныхКлючейСоединения(Знач СписокЗначений) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СерверыОчередей.Код КАК Псевдоним
	|ИЗ
	|	Справочник.СерверыОчередейRMQ КАК СерверыОчередей";
	
	Выборка = Запрос.Выполнить().Выбрать();
	СписокЗначений.Очистить();
	Пока Выборка.Следующий() Цикл
		СписокЗначений.Добавить(Выборка.Псевдоним);
	КонецЦикла;
	
КонецПроцедуры

// Возвращает экземпляр класса, публикующего широковещательные сообщения в exchange
//
// Параметры:
//  ИмяПубликации - идентификатор потока событий
//                - exchange_name в терминах RMQ
//
//  КлючСоединения - произвольное имя, по которому конфигурация-потребитель
//                   сможет выбрать нужный сервер очередей
//
// Возвращаемое значение:
//   Класс ИздательСобытий
//
Функция НовыйИздатель(Знач ИмяПубликации, Знач КлючСоединения = "") Экспорт

	Возврат Обработки.ИздательСобытий.СоздатьПоТипуОбмена(ИмяПубликации, "fanout", КлючСоединения);

КонецФункции // НовыйИздатель()

// Возвращает экземпляр класса, публикующего сообщения.
// каждому сообщению назначается адрес доставки.
//
// Параметры:
//  ИмяПубликации - идентификатор потока событий
//                - exchange_name в терминах RMQ
//
//  КлючСоединения - произвольное имя, по которому конфигурация-потребитель
//                   сможет выбрать нужный сервер очередей
//
// Возвращаемое значение:
//   Класс ИздательСобытий
//
Функция НовыйАдресныйИздатель(Знач ИмяПубликации, Знач КлючСоединения = "") Экспорт

	Возврат Обработки.ИздательСобытий.СоздатьПоТипуОбмена(ИмяПубликации, "direct", КлючСоединения);

КонецФункции // НовыйАдресныйИздатель()

// Возвращает экземпляр класса, публикующего категоризируемые сообщения в exchange
//
// Параметры:
//  ИмяПубликации - идентификатор потока событий
//                - exchange_name в терминах RMQ
//
//  КлючСоединения - произвольное имя, по которому конфигурация-потребитель
//                   сможет выбрать нужный сервер очередей
//
// Возвращаемое значение:
//   Класс ИздательСобытий
//
Функция НовыйТематическийИздатель(Знач ИмяПубликации, Знач КлючСоединения = "") Экспорт

	Возврат Обработки.ИздательСобытий.СоздатьПоТипуОбмена(ИмяПубликации, "topic", КлючСоединения);

КонецФункции // НовыйИздатель()

// Создает объект, читающий события из заданной очереди
//
// Параметры:
//  ИмяОчереди	   - Строка. Имя очереди
//
//  КлючСоединения - произвольное имя, по которому конфигурация-потребитель
//                   сможет выбрать нужный сервер очередей
// 
// Возвращаемое значение:
//   Класс ПолучательСобытий
//
Функция НовыйПодписчик(Знач ИмяОчереди, Знач КлючСоединения = "") Экспорт

	Потребитель = Обработки.ПолучательСобытий.Создать();
	Потребитель.ПодписатьсяНаОчередь(ИмяОчереди, КлючСоединения);
	Возврат Потребитель;

КонецФункции // НовыйПодписчик()

// Создает серверную часть асинхронного сервиса
//
//  ИмяСервиса     - имя публикуемого сервиса
//
//  КлючСоединения - произвольное имя, по которому конфигурация-потребитель
//                   сможет выбрать нужный сервер очередей
//
Функция НовыйАсинхронныйСервис(Знач ИмяСервиса, Знач КлючСоединения = "") Экспорт

	Обработка = Обработки.АсинхронныйСервис.Создать();
	Обработка.КлючСоединения = КлючСоединения;
	Обработка.УстановитьИмяСервиса(ИмяСервиса);
	
	Возврат Обработка;

КонецФункции // НовыйАсинхронныйСервис()

// Создает клиентскую часть асинхронного сервиса
//
//  ИмяСервиса     - Имя сервиса, который нужно вызвать
//
//  КлючСоединения - произвольное имя, по которому конфигурация-потребитель
//                   сможет выбрать нужный сервер очередей
//
Функция НовыйКлиентАсинхронногоСервиса(Знач ИмяСервиса, Знач КлючСоединения = "") Экспорт

	Обработка = Обработки.КлиентАсинхронногоСервиса.Создать();
	Обработка.КлючСоединения = КлючСоединения;
	Обработка.УстановитьИмяСервиса(ИмяСервиса);
	
	Возврат Обработка;

КонецФункции // НовыйАсинхронныйСервис()
